import re
msg = "Оновлений графік погодинних вимкнень на 18 лютого за командою НЕК «Укренерго».Години відсутності електропостачання: 1.1: 00:30 – 03:30, 07:00 – 09:30, 12:30 – 15:30, 18:30 – 21:30 6.1: 01:00 – 04:00, 07:30 – 10:00, 13:00 – 16:00, 19:00 – 22:00"
match = re.search(r"6\.1:(.*?)(?=\d\.\d:|$)", msg)

queue_content = match.group(1)
# Шукаємо всі пари часу в межах знайденого блоку
intervals = re.findall(r"(\d{2}:\d{2})\s*[–-]\s*(\d{2}:\d{2})", queue_content)
result = [list(i) for i in intervals]
print(result)